

'use strict'


//Необходимо реализовать функцию, которая при каждом вызове будет выводить следующее число Фибоначчи
//  *Созвёздочкой -  Реализовать задание только с одной объявленной в глобальном контексте функцией.
//   Требования . 
// В скрипте не должно выть глобальных переменных. 
// Допускается наличие максимум двух объявленных функций в глобальном
// контексте (основная - fibonacci, и функция-помощник). Для задания со
// звёздочкой – максимум одна объявленная функция в глобальном контексте.
// Внутри функции может быть создано любое количество переменных и функций. 
// Функции не должны принимать на вход аргументы

//Пример 

    function makeFibonacciFunction() { 
                                           

    }
    const fibonacci = makeFibonacciFunction();

    fibonacci(); // Вывод в консоль: 1
    fibonacci(); // Вывод в консоль: 2
    fibonacci(); // Вывод в консоль: 3
    fibonacci(); // Вывод в консоль: 4
    fibonacci(); // Вывод в консоль: 5

    // Со звёздочкой

    const fibonacci = // some magic...
    
    fibonacci(); // Вывод в консоль: 1
    fibonacci(); // Вывод в консоль: 2
    fibonacci(); // Вывод в консоль: 3
    fibonacci(); // Вывод в консоль: 4
    fibonacci(); // Вывод в консоль: 5
